# RbsEnergyAnalysisViewInnerShellMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisViewInnerShellMode Property
ParameterTypeId Class See Also
---
"Show Inner Space Shells"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisViewInnerShellMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisViewInnerShellMode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewInnerShellMode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace